import psycopg2
from sentence_transformers import SentenceTransformer

conn = psycopg2.connect(
    host="localhost",
    port=5432,
    database="mydatabase",
    user="myuser",
    password="mypassword"
)

cur = conn.cursor()

embedder = SentenceTransformer("BAAI/bge-m3")

def add_ducument(text):
    embedding = embedder.encode(text).tolist()
    cur.execute("INSERT INTO documents (content, embedding) VALUES (%s, %s)", (text, embedding))
    conn.commit()
    
documents = [
    "ศูนย์บริการตรวจสอบและรับรองมาตรฐาน (Center of Excellence in Testing : CED) เป็นหน่วยงานภายในคณะวิทยาศาสตร์ มหาวิทยาลัยสงขลานครินทร์ ให้บริการตรวจวิเคราะห์และรับรองคุณภาพตัวอย่างทางวิทยาศาสตร์แก่หน่วยงานภายในและภายนอกมหาวิทยาลัย",

    "ศูนย์บริการตรวจสอบและรับรองมาตรฐาน ก่อตั้งขึ้นจากหน่วยเครื่องมือกลางเมื่อปี พ.ศ. 2531 เพื่อสนับสนุนงานวิจัยและให้บริการตรวจวิเคราะห์แก่ภาคอุตสาหกรรม ชุมชน และหน่วยงานภาครัฐ",

    "ศูนย์ CED ให้บริการตรวจวิเคราะห์คุณภาพน้ำดื่ม น้ำใช้ และน้ำทิ้ง รวมถึงการตรวจสอบสารเคมี โลหะหนัก และสารอินทรีย์ในตัวอย่างต่าง ๆ",

    "ศูนย์ CED ให้บริการวิเคราะห์ตัวอย่างด้วยเครื่องมือวิทยาศาสตร์ขั้นสูง เช่น ICP-OES, GC และ HPLC เพื่อให้ได้ผลการทดสอบที่ถูกต้องและเชื่อถือได้",

    "ศูนย์บริการตรวจสอบและรับรองมาตรฐาน ได้รับการรับรองระบบคุณภาพตามมาตรฐาน ISO/IEC 17025:2017 สำหรับห้องปฏิบัติการทดสอบและสอบเทียบ",

    "ศูนย์ CED ให้บริการให้คำปรึกษาทางวิชาการด้านการทดสอบ วิเคราะห์ และการรับรองมาตรฐานแก่ภาคอุตสาหกรรมและหน่วยงานภายนอก",

    "ที่ตั้งของศูนย์บริการตรวจสอบและรับรองมาตรฐาน อยู่ที่คณะวิทยาศาสตร์ มหาวิทยาลัยสงขลานครินทร์ 15 ถนนกาญจนวณิชย์ อำเภอหาดใหญ่ จังหวัดสงขลา 90110",

    "ศูนย์ CED เปิดให้บริการในวันจันทร์ถึงวันศุกร์ เวลา 08.30 ถึง 16.30 น.",
]


for doc in documents:
    add_ducument(doc)

cur.close()
conn.close()